[
    {"name": "Cold Calls", 
    "firstArt": "My team and I are happy to take on all the responsibilities, from finding leads to scheduling appointments with them, thus leaving you time to deal with other important matters.Our aim is to ensure you reach the right audience and get the highest deliverability/conversion rates possible. Cold calling efficiency decreases over the years but we've found an appropriate funnel structure where cold calls reveal in all their glory.Feel free to check it out here - https://miro.com/app/board/uXjVOxPVFBc=/.", 
    "secondArt":"We can create multi-channel outreach for different types of audiences. From our experience, the best way is to create a complex sales process rather than keeping it simple with one channel for outreach. We do believe that cold calling has to be warmed in advance. As you can see the main goal of my team is to unload you from the whole pre-sales process by covering each step.Our team works on various factors that affect a successful outbound campaign – We ensure you aren’t hitting spam filters by improving your domain’s deliverability. From there we make sure valid contact details are acquired and then pair that with an amazing copy to win you as much business as possible.I'm curious if you have this covered, and have you done cold calling before? In case you did, what was the result?To allay your doubts - we stipulate the calling script with you and help it improve over time by analyzing the statistics, and most importantly all the cold callers are native English speakers.Please let me know if that's worthy of consideration, I'd love to hop on a brief call and discuss your project further."
    },
    {"name": "Reserch", 
    "firstArt": "", 
    "secondArt":"I’d love to help as we specialize in building you a strong pipeline, we provide high-quality leads and help nurture them into new business for clients all over the world.First of all - we get the criteria of your Ideal Client Profile from the ICP questionnaire we kindly ask you to fill out. A few simple criteria like revenue, industry, job titles, and other details about the leads you believe should be interested in your business.When completed - we provide this info to our Market Research Department so they could create a tailor-made estimate for your business on the rough volume of prospects in your selected niche, pricing estimates, and an idea of timeframes to have the list delivered back.In a few days, we provide you with a sample consisting of 25-50 prospects, for you to take a look at and let us know if we're on the right track. My team is able to provide you with around 300 leads on a weekly basis.All leads are validated with a couple of software we use but would like to keep it a secret : )To pair with our prospecting offer, we also provide outreach support and extended sales teams. If this is also of interest then it would be great to discuss. Simply put - my team is able to cover the whole pre-sales process for you.Look forward to your thoughts. Please drop me a message and we can get started!"
    },
    {"name": "Outreach", 
    "firstArt": "I believe Cliqbird is the one you're looking for. We provide bespoke outbound campaigns for clients like yourself – Our team specializes in crafting different funnel structures that actually work, winning you more business and boosting your revenues.Our aim is to ensure you reach the right audience and get the highest deliverability/conversion rates possible.", 
    "secondArt":"Our team works on various factors that affect a successful outbound campaign – We ensure you aren’t hitting spam filters by improving your domain’s deliverability, collecting the list of contacts, creating the templates and then hitting the outreach itself, using the most effective funnel for your project. Feel free to check out one of them here - https://miro.com/app/board/uXjVOxPVFBc=/.Having 4+ years of experience behind us we specialize in various industries and have done bespoke campaigns in most of them.Your case cought my eye so I wanted to reach out and discuss how Cliqbird can help you.Look forward to hearing back from you, I'd love to arrange a brief call to discuss my offer in more details."
    },
    {"name": "Full outreach", 
    "firstArt": "Looking at your Job post seems like Cliqbird could be a great fit for you. We specialize in crafting different funnel structures that actually work, winning you more business and boosting your revenues.Our team works on various factors that affect a successful outbound campaign – We ensure you aren’t hitting spam filters by improving your domain’s deliverability, collecting the list of contacts, creating the templates and then hitting the outreach itself, using the most effective funnel for your project. Feel free to check out one of them here - https://miro.com/app/board/uXjVOxPVFBc=/.Simply put - we're covering the whole pre-sales process, setting up the constant traffic of appointments, therefore unloading you from such unloved process that takes a lot of time.I want to share one of our cases with you...", 
    "secondArt":"Having 4+ years of experience behind us we specialize in various industries and have done bespoke campaigns in most of them.Your case cought my eye so I wanted to reach out and discuss how Cliqbird can help you.Please let me know the convinient time to sync up and discuss."
    }
]